ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/SVD/HC32F448FAUI.svd
                <register>
                    <name>SCSRVL</name>
                    <description>desc SCSRVL</description>
                    <addressOffset>0xDC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF33F</resetMask>
                    <fields>
                        <field>
                            <name>BUFEN</name>
                            <description>desc BUFEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTOS</name>
                            <description>desc EVTOS</description>
                            <msb>4</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMC</name>
                            <description>desc LMC</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTMS</name>
                            <description>desc EVTMS</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTDS</name>
                            <description>desc EVTDS</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEN</name>
                            <description>desc DEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEN</name>
                            <description>desc PEN</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UEN</name>
                            <description>desc UEN</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZEN</name>
                            <description>desc ZEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCMRVL</name>
                    <description>desc SCMRVL</description>
                    <addressOffset>0xDE</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xCF</resetMask>
                    <fields>
                        <field>
                            <name>AMC</name>
                            <description>desc AMC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MZCE</name>
                            <description>desc MZCE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPCE</name>
                            <description>desc MPCE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCSRWH</name>
                    <description>desc SCSRWH</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF33F</resetMask>
                    <fields>
                        <field>
                            <name>BUFEN</name>
                            <description>desc BUFEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTOS</name>
                            <description>desc EVTOS</description>
                            <msb>4</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMC</name>
                            <description>desc LMC</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTMS</name>
                            <description>desc EVTMS</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTDS</name>
                            <description>desc EVTDS</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEN</name>
                            <description>desc DEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEN</name>
                            <description>desc PEN</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UEN</name>
                            <description>desc UEN</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZEN</name>
                            <description>desc ZEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCMRWH</name>
                    <description>desc SCMRWH</description>
                    <addressOffset>0xE2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xCF</resetMask>
                    <fields>
                        <field>
                            <name>AMC</name>
                            <description>desc AMC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MZCE</name>
                            <description>desc MZCE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPCE</name>
                            <description>desc MPCE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCSRWL</name>
                    <description>desc SCSRWL</description>
                    <addressOffset>0xE4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF33F</resetMask>
                    <fields>
                        <field>
                            <name>BUFEN</name>
                            <description>desc BUFEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTOS</name>
                            <description>desc EVTOS</description>
                            <msb>4</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMC</name>
                            <description>desc LMC</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTMS</name>
                            <description>desc EVTMS</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTDS</name>
                            <description>desc EVTDS</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEN</name>
                            <description>desc DEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEN</name>
                            <description>desc PEN</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UEN</name>
                            <description>desc UEN</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZEN</name>
                            <description>desc ZEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCMRWL</name>
                    <description>desc SCMRWL</description>
                    <addressOffset>0xE6</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xCF</resetMask>
                    <fields>
                        <field>
                            <name>AMC</name>
                            <description>desc AMC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MZCE</name>
                            <description>desc MZCE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPCE</name>
                            <description>desc MPCE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCSRXH</name>
                    <description>desc SCSRXH</description>
                    <addressOffset>0xE8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF33F</resetMask>
                    <fields>
                        <field>
                            <name>BUFEN</name>
                            <description>desc BUFEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTOS</name>
                            <description>desc EVTOS</description>
                            <msb>4</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMC</name>
                            <description>desc LMC</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTMS</name>
                            <description>desc EVTMS</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTDS</name>
                            <description>desc EVTDS</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEN</name>
                            <description>desc DEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEN</name>
                            <description>desc PEN</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UEN</name>
                            <description>desc UEN</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZEN</name>
                            <description>desc ZEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCMRXH</name>
                    <description>desc SCMRXH</description>
                    <addressOffset>0xEA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xCF</resetMask>
                    <fields>
                        <field>
                            <name>AMC</name>
                            <description>desc AMC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MZCE</name>
                            <description>desc MZCE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPCE</name>
                            <description>desc MPCE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCSRXL</name>
                    <description>desc SCSRXL</description>
                    <addressOffset>0xEC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF33F</resetMask>
                    <fields>
                        <field>
                            <name>BUFEN</name>
                            <description>desc BUFEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTOS</name>
                            <description>desc EVTOS</description>
                            <msb>4</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMC</name>
                            <description>desc LMC</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTMS</name>
                            <description>desc EVTMS</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTDS</name>
                            <description>desc EVTDS</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEN</name>
                            <description>desc DEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEN</name>
                            <description>desc PEN</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UEN</name>
                            <description>desc UEN</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZEN</name>
                            <description>desc ZEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCMRXL</name>
                    <description>desc SCMRXL</description>
                    <addressOffset>0xEE</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xCF</resetMask>
                    <fields>
                        <field>
                            <name>AMC</name>
                            <description>desc AMC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MZCE</name>
                            <description>desc MZCE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPCE</name>
                            <description>desc MPCE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
